app/controllers/companies_controller.rb

INSERT INTO "companies" ("name", "address_line1", "address_line2", "city", "state", "zip", "phone", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @company = Company.new(company_params)
    if @company.save